In [30]:
import pandas as pd
import numpy as np

df=pd.read_csv('data/cleaned.csv')

In [31]:
df.head()

                   location  total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      1056.0   2.0      1.0   39.07  2.0
1          Chikka Tirupathi      2600.0   5.0      3.0  120.00  4.0
2               Uttarahalli      1440.0   2.0      3.0   62.00  3.0
3        Lingadheeranahalli      1521.0   3.0      1.0   95.00  3.0
4                  Kothanur      1200.0   2.0      1.0   51.00  2.0

In [32]:

cols = [col for col in df if col != 'price'] + ['price']
df = df[cols]

In [33]:
df.head()

                   location  total_sqft  bath  balcony  bhk   price
0  Electronic City Phase II      1056.0   2.0      1.0  2.0   39.07
1          Chikka Tirupathi      2600.0   5.0      3.0  4.0  120.00
2               Uttarahalli      1440.0   2.0      3.0  3.0   62.00
3        Lingadheeranahalli      1521.0   3.0      1.0  3.0   95.00
4                  Kothanur      1200.0   2.0      1.0  2.0   51.00

In [34]:
df.to_csv('data/cleaned1.csv', index=False)

In [35]:
df.isnull().sum()

location      0
total_sqft    0
bath          0
balcony       0
bhk           0
price         0
dtype: int64

In [36]:
df['location'].value_counts()

location
Whitefield                 487
Sarjapur  Road             363
Electronic City            282
Kanakpura Road             269
Thanisandra                220
                          ...
Rahmath Nagar                1
Chikkanahalli                1
Halanayakanahalli            1
Air View Colony              1
mvj engineering college      1
Name: count, Length: 1174, dtype: int64

In [46]:
location_counts = df['location'].value_counts()

# Filter locations that appear more than 10 times
frequent_locations = location_counts[location_counts > 25].index

# Filter DataFrame to keep only those rows with frequent locations
df_filtered = df[df['location'].isin(frequent_locations)]

In [47]:
df_filtered['location'].value_counts()

location
Whitefield           487
Sarjapur  Road       363
Electronic City      282
Kanakpura Road       269
Thanisandra          220
                    ...
Chikkalasandra        28
Somasundara Palya     28
Ambalipura            27
Kodichikkanahalli     26
BTM 2nd Stage         26
Name: count, Length: 103, dtype: int64

In [48]:
df_filtered.to_csv('data/cleaned2.csv', index=False)

In [50]:
df_filtered.shape

(7396, 6)